Repository: nishlumi/vrmviewmdoc
Catalog: docs/source/locale/*/LC_MESSAGES/man4/animation_*.po
Languages: tl

source: タイムラインの表示に関するいくつか
tl: A few things about timeline display

source: タイムラインのツールバーについて説明していきます。
tl: We will explain the timeline toolbar.

source: |tlprev| と |tlnext| は他の操作で代替できるためボタンを廃止しました。
tl: The |tlprev| and |tlnext| buttons have been removed because they can be replaced with other operations.

source: |tlout| **タイムラインの表示を縮小する**
tl: |tlout| **Shrink timeline view**

source: タイムラインの表示をコンパクトにします。
tl: Make the timeline display compact.

source: |tlin| **タイムラインの表示を拡大する**
tl: |tlin| **Expand timeline view**

source: タイムラインの表示を通常のサイズにします。これが標準サイズです。
tl: Resize the timeline display to normal size. This is the standard size.

source: |tlplay| **最初から再生、再生/一時停止、停止**
tl: |tlplay| **play from beginning, play/pause, stop**

source: リボンバーのアニメーションタブにあるボタンを同様の機能です。
tl: It has the same function as the button on the animation tab of the ribbon bar.

source: |tlload| **このフレームを読み込む**
tl: |tlload| **load this frame**

source: 現在選択中のフレーム位置に該当する全タイムライン（ロール）のキーフレームの内容を即座に読み込み、ポーズやプロパティを復元します。通常はフレーム位置を選択すると自動的に復元されますが、それを手動で呼び出すボタンです。
tl: Immediately read the contents of the keyframes of all timelines (rolls) corresponding to the currently selected frame position, and restore poses and properties. Selecting a frame position normally restores it automatically, but this button manually calls it.

source: ※設定の ``フレームを選択する時、プレビューする`` がオフの場合のみ表示されます。
tl: * Displayed only if ``Preview when selecting a frame`` in the settings is off.

source: 現在選択中のタイムラインのキーフレームの設定画面を開きます。
tl: Opens the keyframe settings screen for the currently selected timeline.

source: |tladdkey| **キーフレームに登録**
tl: |tladdkey| **Register to key frame**

source: 現在選択しているタイムラインにキーフレームを登録します。リボンバーの同じボタンと異なり、こちらは登録ウィンドウなしですぐに登録します。
tl: Registers a keyframe on the currently selected timeline. Unlike the same button on the ribbon bar, this one registers immediately without a registration window.

source: |tldelkey| **キーフレームを削除**
tl: |tldelkey| **Delete keyframe**

source: 現在選択中のタイムラインのキーフレームを削除します。
tl: Deletes the currently selected timeline keyframe.

source: |tlinsf| **現在位置に空のフレームを挿入**
tl: |tlinsf| **Insert an empty frame at the current position**

source: 現在選択しているフレーム番号の位置のタイムラインすべてに空のフレームを挿入します。これによりこのフレーム番号以降のキーフレームはすべて1つずつ右にズレます。
tl: Inserts an empty frame into all timelines at the position of the currently selected frame number. This shifts all keyframes after this frame number to the right by one.

source: |tldelf| **現在のフレーム位置を削除**
tl: |tldelf| **delete current frame position**

source: すべてのタイムラインの現在選択しているフレーム位置を削除します。これは単なるキーフレームの削除ではなくフレーム位置の削除を伴うため、このフレーム以降のキーフレームはすべて一つずつ左にズレます。
tl: Deletes the currently selected frame position of all timelines. Since this involves deleting a frame position, not just deleting a keyframe, all keyframes after this frame will be shifted one by one to the left.

source: また、現在位置にキーフレームが存在した場合はそのキーフレーム共々削除されますのでご注意ください。
tl: Also, please note that if there is a keyframe at the current position, it will be deleted together.

source: |tlshowkey| **現在選択中のフレーム番号**
tl: |tlshowkey| **Currently selected frame number**

source: 現在のフレーム番号を表示します。
tl: Displays the current frame number.

source: |tlseek| **シークバー**
tl: |tlseek| **Seek Bar**

source: タイムラインのうちフレーム位置を好きな位置に移動します。フレーム数が増減してもこのシークバーのサイズは変わりません。
tl: Move the frame position to any position on the timeline. The size of this seek bar does not change even if the number of frames increases or decreases.

source: ※設定の ``フレームを選択する時、プレビューする`` がオンの場合、ゆっくり動かすとアニメーションをコマ送りしてプレビュー再生することができます。（一部のプロパティはプレビューされません）
tl: If ``Preview when selecting a frame`` in the settings is on, you can preview the animation frame by frame by moving it slowly. (some properties are not previewed)

source: HTMLとWebGLの連動の仕様上、あまり素早く動かすとプレビューが追いつかないことがあります。
tl: Due to the interlocking specifications of HTML and WebGL, the preview may not keep up if you move it too quickly.

source: |tlvisi| **タイムラインのキャスト（オブジェクト）の表示・非表示を切り替える**
tl: |tlvisi| **Show/hide timeline cast (object)**

source: 選択中のタイムラインのキャストを非表示にすることができます。非表示にしてもIKマーカーは引き続き表示されます。（別キャストを選択すればIKマーカーすら表示されません）
tl: You can hide the cast of the selected timeline. IK markers will still be visible when hidden. (If you select another cast, even the IK marker will not be displayed)
